examples/plasma-jet/free-jet/1_flow_turb/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class       dictionary;
object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0000e+00;

vertices
(
(-1.41421356e-04  -1.41421356e-04 2.00000000e-03)  // p  0 
(1.41421356e-04  -1.41421356e-04 2.00000000e-03)  // p  1 
(1.41421356e-04  1.41421356e-04 2.00000000e-03)  // p  2 
(-1.41421356e-04  1.41421356e-04 2.00000000e-03)  // p  3 
(-1.41421356e-04  -1.41421356e-04 1.50000000e-02)  // p  4 
(1.41421356e-04  -1.41421356e-04 1.50000000e-02)  // p  5 
(1.41421356e-04  1.41421356e-04 1.50000000e-02)  // p  6 
(-1.41421356e-04  1.41421356e-04 1.50000000e-02)  // p  7 
(-1.41421356e-04  -1.41421356e-04 4.50000000e-02)  // p  8 
(1.41421356e-04  -1.41421356e-04 4.50000000e-02)  // p  9 
(1.41421356e-04  1.41421356e-04 4.50000000e-02)  // p 10 
(-1.41421356e-04  1.41421356e-04 4.50000000e-02)  // p 11 
(-4.24264069e-04  -4.24264069e-04 2.00000000e-03)  // p 12 
(4.24264069e-04  -4.24264069e-04 2.00000000e-03)  // p 13 
(4.24264069e-04  4.24264069e-04 2.00000000e-03)  // p 14 
(-4.24264069e-04  4.24264069e-04 2.00000000e-03)  // p 15 
(-4.24264069e-04  -4.24264069e-04 1.50000000e-02)  // p 16 
(4.24264069e-04  -4.24264069e-04 1.50000000e-02)  // p 17 
(4.24264069e-04  4.24264069e-04 1.50000000e-02)  // p 18 
(-4.24264069e-04  4.24264069e-04 1.50000000e-02)  // p 19 
(-4.24264069e-04  -4.24264069e-04 4.50000000e-02)  // p 20 
(4.24264069e-04  -4.24264069e-04 4.50000000e-02)  // p 21 
(4.24264069e-04  4.24264069e-04 4.50000000e-02)  // p 22 
(-4.24264069e-04  4.24264069e-04 4.50000000e-02)  // p 23 
(-8.83883476e-04  -8.83883476e-04 2.00000000e-03)  // p 24 
(8.83883476e-04  -8.83883476e-04 2.00000000e-03)  // p 25 
(8.83883476e-04  8.83883476e-04 2.00000000e-03)  // p 26 
(-8.83883476e-04  8.83883476e-04 2.00000000e-03)  // p 27 
(-8.83883476e-04  -8.83883476e-04 1.50000000e-02)  // p 28 
(8.83883476e-04  -8.83883476e-04 1.50000000e-02)  // p 29 
(8.83883476e-04  8.83883476e-04 1.50000000e-02)  // p 30 
(-8.83883476e-04  8.83883476e-04 1.50000000e-02)  // p 31 
(-8.83883476e-04  -8.83883476e-04 4.50000000e-02)  // p 32 
(8.83883476e-04  -8.83883476e-04 4.50000000e-02)  // p 33 
(8.83883476e-04  8.83883476e-04 4.50000000e-02)  // p 34 
(-8.83883476e-04  8.83883476e-04 4.50000000e-02)  // p 35 
(-1.41421356e-02  -1.41421356e-02 2.00000000e-03)  // p 36 
(1.41421356e-02  -1.41421356e-02 2.00000000e-03)  // p 37 
(1.41421356e-02  1.41421356e-02 2.00000000e-03)  // p 38 
(-1.41421356e-02  1.41421356e-02 2.00000000e-03)  // p 39 
(-1.41421356e-02  -1.41421356e-02 1.50000000e-02)  // p 40 
(1.41421356e-02  -1.41421356e-02 1.50000000e-02)  // p 41 
(1.41421356e-02  1.41421356e-02 1.50000000e-02)  // p 42 
(-1.41421356e-02  1.41421356e-02 1.50000000e-02)  // p 43 
(-1.41421356e-02  -1.41421356e-02 4.50000000e-02)  // p 44 
(1.41421356e-02  -1.41421356e-02 4.50000000e-02)  // p 45 
(1.41421356e-02  1.41421356e-02 4.50000000e-02)  // p 46 
(-1.41421356e-02  1.41421356e-02 4.50000000e-02)  // p 47 
);

blocks
(
    hex (  0    1    2    3    4    5    6    7)(   12   12   70 ) simpleGrading (  1  1  1 ) // block  0 
    hex (  4    5    6    7    8    9   10   11)(   12   12  220 ) simpleGrading (  1  1  3 ) // block  1 
    hex (  1    0   12   13    5    4   16   17)(   12    4   70 ) simpleGrading (  1  1  1 ) // block  2 
    hex (  2    1   13   14    6    5   17   18)(   12    4   70 ) simpleGrading (  1  1  1 ) // block  3 
    hex (  3    2   14   15    7    6   18   19)(   12    4   70 ) simpleGrading (  1  1  1 ) // block  4 
    hex (  0    3   15   12    4    7   19   16)(   12    4   70 ) simpleGrading (  1  1  1 ) // block  5 
    hex (  5    4   16   17    9    8   20   21)(   12    4  220 ) simpleGrading (  1  1  3 ) // block  6 
    hex (  6    5   17   18   10    9   21   22)(   12    4  220 ) simpleGrading (  1  1  3 ) // block  7 
    hex (  7    6   18   19   11   10   22   23)(   12    4  220 ) simpleGrading (  1  1  3 ) // block  8 
    hex (  4    7   19   16    8   11   23   20)(   12    4  220 ) simpleGrading (  1  1  3 ) // block  9 
    hex ( 13   12   24   25   17   16   28   29)(   12   60   70 ) simpleGrading (  1  1  1 ) // block 10 
    hex ( 14   13   25   26   18   17   29   30)(   12   60   70 ) simpleGrading (  1  1  1 ) // block 11 
    hex ( 15   14   26   27   19   18   30   31)(   12   60   70 ) simpleGrading (  1  1  1 ) // block 12 
    hex ( 12   15   27   24   16   19   31   28)(   12   60   70 ) simpleGrading (  1  1  1 ) // block 13 
    hex ( 17   16   28   29   21   20   32   33)(   12   60  220 ) simpleGrading (  1  1  3 ) // block 14 
    hex ( 18   17   29   30   22   21   33   34)(   12   60  220 ) simpleGrading (  1  1  3 ) // block 15 
    hex ( 19   18   30   31   23   22   34   35)(   12   60  220 ) simpleGrading (  1  1  3 ) // block 16 
    hex ( 16   19   31   28   20   23   35   32)(   12   60  220 ) simpleGrading (  1  1  3 ) // block 17 
    hex ( 25   24   36   37   29   28   40   41)(   12   80   70 ) simpleGrading (  1 10  1 ) // block 18 
    hex ( 26   25   37   38   30   29   41   42)(   12   80   70 ) simpleGrading (  1 10  1 ) // block 19 
    hex ( 27   26   38   39   31   30   42   43)(   12   80   70 ) simpleGrading (  1 10  1 ) // block 20 
    hex ( 24   27   39   36   28   31   43   40)(   12   80   70 ) simpleGrading (  1 10  1 ) // block 21 
    hex ( 29   28   40   41   33   32   44   45)(   12   80  220 ) simpleGrading (  1 10  3 ) // block 22 
    hex ( 30   29   41   42   34   33   45   46)(   12   80  220 ) simpleGrading (  1 10  3 ) // block 23 
    hex ( 31   30   42   43   35   34   46   47)(   12   80  220 ) simpleGrading (  1 10  3 ) // block 24 
    hex ( 28   31   43   40   32   35   47   44)(   12   80  220 ) simpleGrading (  1 10  3 ) // block 25 
);

edges
(
    arc   0    1  (0.00000000e+00  -1.70710678e-04 2.00000000e-03)
    arc   1    2  (1.70710678e-04  0.00000000e+00 2.00000000e-03)
    arc   2    3  (0.00000000e+00  1.70710678e-04 2.00000000e-03)
    arc   3    0  (-1.70710678e-04  0.00000000e+00 2.00000000e-03)
    arc   4    5  (0.00000000e+00  -1.70710678e-04 1.50000000e-02)
    arc   5    6  (1.70710678e-04  0.00000000e+00 1.50000000e-02)
    arc   6    7  (0.00000000e+00  1.70710678e-04 1.50000000e-02)
    arc   7    4  (-1.70710678e-04  0.00000000e+00 1.50000000e-02)
    arc   8    9  (0.00000000e+00  -1.70710678e-04 4.50000000e-02)
    arc   9   10  (1.70710678e-04  0.00000000e+00 4.50000000e-02)
    arc  10   11  (0.00000000e+00  1.70710678e-04 4.50000000e-02)
    arc  11    8  (-1.70710678e-04  0.00000000e+00 4.50000000e-02)
    arc  12   13  (0.00000000e+00  -6.00000000e-04 2.00000000e-03)
    arc  13   14  (6.00000000e-04  0.00000000e+00 2.00000000e-03)
    arc  14   15  (0.00000000e+00  6.00000000e-04 2.00000000e-03)
    arc  15   12  (-6.00000000e-04  0.00000000e+00 2.00000000e-03)
    arc  16   17  (0.00000000e+00  -6.00000000e-04 1.50000000e-02)
    arc  17   18  (6.00000000e-04  0.00000000e+00 1.50000000e-02)
    arc  18   19  (0.00000000e+00  6.00000000e-04 1.50000000e-02)
    arc  19   16  (-6.00000000e-04  0.00000000e+00 1.50000000e-02)
    arc  20   21  (0.00000000e+00  -6.00000000e-04 4.50000000e-02)
    arc  21   22  (6.00000000e-04  0.00000000e+00 4.50000000e-02)
    arc  22   23  (0.00000000e+00  6.00000000e-04 4.50000000e-02)
    arc  23   20  (-6.00000000e-04  0.00000000e+00 4.50000000e-02)
    arc  24   25  (0.00000000e+00  -1.25000000e-03 2.00000000e-03)
    arc  25   26  (1.25000000e-03  0.00000000e+00 2.00000000e-03)
    arc  26   27  (0.00000000e+00  1.25000000e-03 2.00000000e-03)
    arc  27   24  (-1.25000000e-03  0.00000000e+00 2.00000000e-03)
    arc  28   29  (0.00000000e+00  -1.25000000e-03 1.50000000e-02)
    arc  29   30  (1.25000000e-03  0.00000000e+00 1.50000000e-02)
    arc  30   31  (0.00000000e+00  1.25000000e-03 1.50000000e-02)
    arc  31   28  (-1.25000000e-03  0.00000000e+00 1.50000000e-02)
    arc  32   33  (0.00000000e+00  -1.25000000e-03 4.50000000e-02)
    arc  33   34  (1.25000000e-03  0.00000000e+00 4.50000000e-02)
    arc  34   35  (0.00000000e+00  1.25000000e-03 4.50000000e-02)
    arc  35   32  (-1.25000000e-03  0.00000000e+00 4.50000000e-02)
    arc  36   37  (0.00000000e+00  -2.00000000e-02 2.00000000e-03)
    arc  37   38  (2.00000000e-02  0.00000000e+00 2.00000000e-03)
    arc  38   39  (0.00000000e+00  2.00000000e-02 2.00000000e-03)
    arc  39   36  (-2.00000000e-02  0.00000000e+00 2.00000000e-03)
    arc  40   41  (0.00000000e+00  -2.00000000e-02 1.50000000e-02)
    arc  41   42  (2.00000000e-02  0.00000000e+00 1.50000000e-02)
    arc  42   43  (0.00000000e+00  2.00000000e-02 1.50000000e-02)
    arc  43   40  (-2.00000000e-02  0.00000000e+00 1.50000000e-02)
    arc  44   45  (0.00000000e+00  -2.00000000e-02 4.50000000e-02)
    arc  45   46  (2.00000000e-02  0.00000000e+00 4.50000000e-02)
    arc  46   47  (0.00000000e+00  2.00000000e-02 4.50000000e-02)
    arc  47   44  (-2.00000000e-02  0.00000000e+00 4.50000000e-02)
);

boundary
(
   gasInlet
   {
      type inlet ;
      faces (
         (  3   2   1   0)
         ( 13  12   0   1)
         ( 14  13   1   2)
         ( 15  14   2   3)
         ( 12  15   3   0)
      );
   }
   dielInlet
   {
      type patch ;
      faces (
         ( 25  24  12  13)
         ( 26  25  13  14)
         ( 27  26  14  15)
         ( 24  27  15  12)
      );
   }
   airInlet
   {
      type patch ;
      faces (
         ( 37  36  24  25)
         ( 38  37  25  26)
         ( 39  38  26  27)
         ( 36  39  27  24)
      );
   }
   outlet
   {
      type patch ;
      faces (
         (  8   9  10  11)
         (  9   8  20  21)
         ( 10   9  21  22)
         ( 11  10  22  23)
         (  8  11  23  20)
         ( 21  20  32  33)
         ( 22  21  33  34)
         ( 23  22  34  35)
         ( 20  23  35  32)
         ( 33  32  44  45)
         ( 34  33  45  46)
         ( 35  34  46  47)
         ( 32  35  47  44)
      );
   }
   topBoundary
   {
      type outlet;
      faces (
         ( 41  40  36  37)
         ( 42  41  37  38)
         ( 43  42  38  39)
         ( 40  43  39  36)
         ( 45  44  40  41)
         ( 46  45  41  42)
         ( 47  46  42  43)
         ( 44  47  43  40)
      );
   }
);

mergePatchPairs();