examples/plasma-jet/free-jet/1_flow_turb/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    HeInlet
    {
        type            turbulentInlet;
        referenceField  uniform (0 0 48.2582);
        fluctuationScale (0.01 0.01 0.02);
        value           uniform (0 0 48.2582);
    }   

    airInlet
    {
        type            zeroGradient;
    }

    dielWalls
    {
        type            noSlip;
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    farfield
    {
        type            pressureInletOutletVelocity;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
