examples/plasma-jet/free-jet/1_flow_turb/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    HeInlet
    {
        type            zeroGradient;
    }   

    airInlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    farfield
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
